{"username":["yadcapital2020"],"password":["magic2020"],"legal_disclaimer":["This website is not an offer to sell or the solicitation of an offer to buy limited partnership interests in any investment vehicles managed by YAD Capital LLC. An offering of interests will be made only by means of a confidential private placement memorandum and only to qualified investors in juridictions where permitted by law.\nProspective investors should not rely on the information available on this website and are strongly urged to review the confidential private placement memorandum carefully and consult with their own financial, legal and tax advisors before investing.\nThis website and its contents are proprietary information of YAD Capital LLC and any reproduction of this information, in whole or in part, without the prior written consent of YAD Capital LLC is prohibited. Additional information is available upon request."],"about":["YAD Capital is an alternative asset management firm that seeks to generate attractive risk-adjusted returns by opportunistically investing in short-term financing products with expected yields ranging from the low-teens to mid-twenties.\n\nWe provide a select group of qualified high net worth individuals, family offices, and institutions access to unique investment opportunities.\n\nWe thoroughly build our portfolio through extensive due diligence and investment selection to ensure compliance with our strategy. We strive to provide uncorrelated alpha, low volatility, and diversification.\n\nWe currently invest in two strategies: [Small Business Financing] and [Real Estate Financing]."],"mca_head_paragraph":["Merchant Cash Advance is a financing solution for small businesses whereby a company sells a portion of its future revenues at a discounted purchase price in exchange for a lump sum payment.","Marketplace lending is a relatively new segment of the alternative investment landscape that was born following the Great Recession of 2008. As banks tightened their lending standards and faced increased regulatory oversight, they exited many segments of the direct lending market. The result created a void of lending solutions that we intend to fill.","We acquire participation interests sold by companies that have made Merchant Cash Advance to various businesses. We diversify our portfolio by investing across the entire spectrum of opportunity set (industry, geography, and quality of paper) and we monitor our portfolio on a daily basis."],"mca_funcding_title":["{YAD Funding Opportunity LP}","{YAD Funding Opportunity II LP}","{YAD Funding Opportunity III LP}","{YAD Funding Opportunity IV LP}","{YAD LAF SPV LLC}"],"mca_funcding_paragraph":["Final Closing: March 31, 2018\n[Fully invested]","Final Closing: September 30, 2018\n[Fully invested]","Final Closing: April 30, 2019\n[Fully invested]","Expected Closing: March 31, 2020\n[Currently investing]","Evergreen Fund\n[Currently investing]"],"mca_ball_title":["{$70M}","{3,800}","{3,000}","{50}"],"mca_ball_text":["Invested","Businesses Funded","Paid Off Advances","States + DC + P.R."],"red_head_paragraph":["YAD Capital is a fully-integrated, nationwide real estate investment firm that sources, underwrites, closes, and services commercial real estate debt. We seek to capitalize on complex special situations in which liquidity and time are limited.","Instruments:     Senior Secured loans, Mezzanine debt and Preferred Equity investments\nPurpose:           Acquisition, Refinancing, Development\nDeal Size:         Up to $50 million\nHolding:            6 months to 36 months\nGeography:      Continental US\nAsset Class:     All commercial real estate assets","We also acquire first lien U.S. residential and commercial real estate loans that are non-performing, sub-performing, in default or in foreclosure proceedings.","{{[]}}"],"team_card_img":["images\/DavidPerez.jpg","images\/danielRubin.jpg"],"team_card_name":["David Perez","Daniel Rubin"],"team_card_title":["Co-Founding Partner","Co-Founding Partner"],"team_card_linkedin":["https:\/\/www.linkedin.com\/in\/david-perez-a65b04124\/","https:\/\/www.linkedin.com\/in\/daniel-rubin\/"],"team_card_email":["david@yadcapital.com","daniel@yadcapital.com"],"team_card_bio":["Mr. David Perez has over 20 years of trading and investment experience in liquid macro assets.\nPrior to co-founding YAD Capital, Mr. Perez was a senior Portfolio Manager and Managing Director at MKP Capital Management LLC, a $7 billion diversified alternative asset manager focused on macro and credit opportunities, where he was managing a $500 million portfolio of stocks, bonds, credit and currencies.\nPrior to that, Mr. Perez was a Managing Director at Goldman Sachs, where he spent 14 years, most recently as the Head of its US Index Volatility Trading Business. He spent the first 6 years in London, and the last 8 years in New York.\nMr. Perez studied in Paris, France where he received a B.A. in Computer Sciences and Mathematics from University Paris Dauphine, as well as an M.S. degree in Finance.","Mr. Daniel Rubin has over 21 years of principal investing, investment banking, restructuring and operational experience, primarily in the real estate industry.\nPrior to co-founding YAD Capital, Mr. Rubin was the COO & CFO of Halpern Real Estate Ventures LLC where he assumed a strategic role in the overall management of the firm and was responsible for executing and managing over $650 million of real estate transactions.\nPrior to that, Mr. Rubin invested in and advised several real estate operating companies, REITs and private equity real estate firms on more than $4.5 billion of complex corporate finance transactions at various organizations including Silverkey Capital, JEN Partners, Lehman Brothers and EdgeRock Realty Advisors. Mr. Rubin started his career at Deloitte, first as an auditor and subsequently as a turnaround consultant.\nMr. Rubin holds an MBA from NYU Stern School of Business, an M.S. degree in Financial Engineering from University of Paris Creteil, and a B.S. degree in Accounting, Finance, and Corporate Taxation from University of Paris Dauphine. Mr. Rubin is a member of the NYU Stern School of Business Alumni Council and Chair of its Finance Committee."],"press_section_data":["[December 19, 2019]\n{[YAD Capital and Realio join forces to raise a $5 million tokenized fund]}\nRealio will issue a $5 million tokenized fund via the Reg D 506 (c) and Reg S exemptions, enabling global participation in a niche investment product normally reserved for a select subset of institutional investors.","[September 26, 2019]\n{[YAD Capital partners with Fusion Foundation to bring its alternative credit portfolio onto Fusion’s cryptofinance ecosystem]}\nThe fractionalization of assets enabled by blockchain will bring transparency in the merchant cash advance industry and broaden our global reach to investors."],"press_section_url":["https:\/\/www.prnewswire.com\/news-releases\/realio-and-yad-capital-join-forces-to-raise-a-5-million-tokenized-fund-on-fusion-blockchain-300977876.html?tc=eml_cleartime","https:\/\/bit.ly\/2m7rCZd"],"contact_email_mail":["david@yadcapital.com","daniel@yadcapital.com"],"address_text":["1345 Avenue of the Americas, 33rd floor New York, NY 10105"],"address_pointer":["40.7629384,-73.978958"]}